In [1]:
import numpy as np
import pandas as pd

# DataFrame取列還是取行?

In [2]:
data = pd.DataFrame(np.arange(15).reshape(3,5),index=['one','two','three'],columns=['a','b','c','d','e'])

In [3]:
data

        a   b   c   d   e
one     0   1   2   3   4
two     5   6   7   8   9
three  10  11  12  13  14

In [4]:
# 取指定列,返回series
data['a']

one       0
two       5
three    10
Name: a, dtype: int32

In [5]:
# 取指定列,返回dataframe
data[['a']]

        a
one     0
two     5
three  10

In [6]:
# 取多列
data[['a', 'b']]

        a   b
one     0   1
two     5   6
three  10  11

In [7]:
# 取行,返回series
data.loc['one']

a    0
b    1
c    2
d    3
e    4
Name: one, dtype: int32

In [8]:
# 取行,返回dataframe
data[0:1]

     a  b  c  d  e
one  0  1  2  3  4

In [9]:
# 利用boolean取行
data[[True, False, True]]

        a   b   c   d   e
one     0   1   2   3   4
three  10  11  12  13  14